#include <stdio.h>

int main()
{   
    int h, min;
    scanf ("%d%d", &h, &min);
    int m = h*60 + min;
    if ((m>=23*60 + 40) || (m<= 60 + 40)){printf("Мышь\n");}
    if (m>=60+41 && m<=3*60+54) {printf("Бык\n");}
    if (m>=3*60+55 && m<=5*60+14) {printf("Тигр\n");}
    if (m>=5*60+15 && m<=7*60+40) {printf("Заяц\n");}
    if (m>=7*60+41 && m<=9*60+50) {printf("Дракон\n");}
    if (m>=9*60+51 && m<=11*60+20) {printf("Змея\n");}
    if (m>=11*60+21 && m<=13*60+44) {printf("Лошадь\n");}
    if (m>=13*60+45 && m<=15*60+40) {printf("Коза\n");}
    if (m>=15*60+41 && m<=17*60+40) {printf("Обезьяна\n");}
    if (m>=17*60+41 && m<=19*60+40) {printf("Петух\n");}
    if (m>=19*60+41 && m<=21*60+40) {printf("Собака\n");}
    if (m>=21*60+41 && m<=23*60+39) {printf("Кабан\n");}   

	return 0;
}